---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSizeIterator.Dispose
source: html/9b5a7875-b4fd-e6de-4559-5f760c88857e.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeIterator.Dispose Method

Releases all resources used by the ConduitSizeIterator

## Syntax (C#)
```csharp
public void Dispose()
```